# Makefile

# Компилятор
CXX = g++

# Флаги компиляции
# -std=c++17: Использовать стандарт C++17
# -O3:        Включить максимальный уровень оптимизации (критически важно для тестов производительности)
# -Wall:      Показывать все предупреждения компилятора
# -msse2:     Явно включить поддержку набора инструкций SSE2, к которому относится _mm_div_pd
CXXFLAGS = -std=c++17 -O3 -Wall -msse2

# Имя итогового исполняемого файла
TARGET = homework_58

# Исходные файлы
SRCS = main.cpp

# Цель по умолчанию (выполняется при вызове 'make')
all: $(TARGET)

# Правило для сборки исполняемого файла
$(TARGET): $(SRCS)
	$(CXX) $(CXXFLAGS) -o $(TARGET) $(SRCS)

# Цель для запуска программы
run: all
	./$(TARGET)

# Цель для очистки (удаления скомпилированных файлов)
clean:
	rm -f $(TARGET)